grevaillot/svd_tools/headers/ATSAM3X8H/adc.h
/** @defgroup adc_isr ISR Interrupt Status Register
@{*/

/** ADC_ISR_RXBUFF RX Buffer Full **/
#define ADC_ISR_RXBUFF		(1 << 28)
/** ADC_ISR_ENDRX End of RX Buffer **/
#define ADC_ISR_ENDRX		(1 << 27)
/** ADC_ISR_COMPE Comparison Error **/
#define ADC_ISR_COMPE		(1 << 26)
/** ADC_ISR_GOVRE General Overrun Error **/
#define ADC_ISR_GOVRE		(1 << 25)
/** ADC_ISR_DRDY Data Ready **/
#define ADC_ISR_DRDY		(1 << 24)
/** ADC_ISR_EOC15 End of Conversion 15 **/
#define ADC_ISR_EOC15		(1 << 15)
/** ADC_ISR_EOC14 End of Conversion 14 **/
#define ADC_ISR_EOC14		(1 << 14)
/** ADC_ISR_EOC13 End of Conversion 13 **/
#define ADC_ISR_EOC13		(1 << 13)
/** ADC_ISR_EOC12 End of Conversion 12 **/
#define ADC_ISR_EOC12		(1 << 12)
/** ADC_ISR_EOC11 End of Conversion 11 **/
#define ADC_ISR_EOC11		(1 << 11)
/** ADC_ISR_EOC10 End of Conversion 10 **/
#define ADC_ISR_EOC10		(1 << 10)
/** ADC_ISR_EOC9 End of Conversion 9 **/
#define ADC_ISR_EOC9		(1 << 9)
/** ADC_ISR_EOC8 End of Conversion 8 **/
#define ADC_ISR_EOC8		(1 << 8)
/** ADC_ISR_EOC7 End of Conversion 7 **/
#define ADC_ISR_EOC7		(1 << 7)
/** ADC_ISR_EOC6 End of Conversion 6 **/
#define ADC_ISR_EOC6		(1 << 6)
/** ADC_ISR_EOC5 End of Conversion 5 **/
#define ADC_ISR_EOC5		(1 << 5)
/** ADC_ISR_EOC4 End of Conversion 4 **/
#define ADC_ISR_EOC4		(1 << 4)
/** ADC_ISR_EOC3 End of Conversion 3 **/
#define ADC_ISR_EOC3		(1 << 3)
/** ADC_ISR_EOC2 End of Conversion 2 **/
#define ADC_ISR_EOC2		(1 << 2)
/** ADC_ISR_EOC1 End of Conversion 1 **/
#define ADC_ISR_EOC1		(1 << 1)
/** ADC_ISR_EOC0 End of Conversion 0 **/
#define ADC_ISR_EOC0		(1 << 0)

/**@}*/

/** @defgroup adc_over OVER Overrun Status Register
@{*/

/** ADC_OVER_OVRE15 Overrun Error 15 **/
#define ADC_OVER_OVRE15		(1 << 15)
/** ADC_OVER_OVRE14 Overrun Error 14 **/
#define ADC_OVER_OVRE14		(1 << 14)
/** ADC_OVER_OVRE13 Overrun Error 13 **/
#define ADC_OVER_OVRE13		(1 << 13)
/** ADC_OVER_OVRE12 Overrun Error 12 **/
#define ADC_OVER_OVRE12		(1 << 12)
/** ADC_OVER_OVRE11 Overrun Error 11 **/
#define ADC_OVER_OVRE11		(1 << 11)
/** ADC_OVER_OVRE10 Overrun Error 10 **/
#define ADC_OVER_OVRE10		(1 << 10)
/** ADC_OVER_OVRE9 Overrun Error 9 **/
#define ADC_OVER_OVRE9		(1 << 9)
/** ADC_OVER_OVRE8 Overrun Error 8 **/
#define ADC_OVER_OVRE8		(1 << 8)
/** ADC_OVER_OVRE7 Overrun Error 7 **/
#define ADC_OVER_OVRE7		(1 << 7)
/** ADC_OVER_OVRE6 Overrun Error 6 **/
#define ADC_OVER_OVRE6		(1 << 6)
/** ADC_OVER_OVRE5 Overrun Error 5 **/
#define ADC_OVER_OVRE5		(1 << 5)
/** ADC_OVER_OVRE4 Overrun Error 4 **/
#define ADC_OVER_OVRE4		(1 << 4)
/** ADC_OVER_OVRE3 Overrun Error 3 **/
#define ADC_OVER_OVRE3		(1 << 3)
/** ADC_OVER_OVRE2 Overrun Error 2 **/
#define ADC_OVER_OVRE2		(1 << 2)
/** ADC_OVER_OVRE1 Overrun Error 1 **/
#define ADC_OVER_OVRE1		(1 << 1)
/** ADC_OVER_OVRE0 Overrun Error 0 **/
#define ADC_OVER_OVRE0		(1 << 0)

/**@}*/

/** @defgroup adc_emr EMR Extended Mode Register
@{*/

/** ADC_EMR_TAG TAG of the ADC_LDCR register **/
#define ADC_EMR_TAG		(1 << 24)

#define ADC_EMR_CMPFILTER_SHIFT		12
#define ADC_EMR_CMPFILTER_MASK		0x03
/** @defgroup adc_emr_cmpfilter CMPFILTER Compare Event Filtering
@{*/
/**@}*/

/** ADC_EMR_CMPALL Compare All Channels **/
#define ADC_EMR_CMPALL		(1 << 9)

#define ADC_EMR_CMPSEL_SHIFT		4
#define ADC_EMR_CMPSEL_MASK		0x0f
/** @defgroup adc_emr_cmpsel CMPSEL Comparison Selected Channel
@{*/
/**@}*/


#define ADC_EMR_CMPMODE_SHIFT		0
#define ADC_EMR_CMPMODE_MASK		0x03
/** @defgroup adc_emr_cmpmode CMPMODE Comparison Mode
@{*/
/**@}*/


/**@}*/

/** @defgroup adc_cwr CWR Compare Window Register
@{*/


#define ADC_CWR_HIGHTHRES_SHIFT		16
#define ADC_CWR_HIGHTHRES_MASK		0xfff
/** @defgroup adc_cwr_highthres HIGHTHRES High Threshold
@{*/
/**@}*/


#define ADC_CWR_LOWTHRES_SHIFT		0
#define ADC_CWR_LOWTHRES_MASK		0xfff
/** @defgroup adc_cwr_lowthres LOWTHRES Low Threshold
@{*/
/**@}*/


/**@}*/

/** @defgroup adc_cgr CGR Channel Gain Register
@{*/


#define ADC_CGR_GAIN15_SHIFT		30
#define ADC_CGR_GAIN15_MASK		0x03
/** @defgroup adc_cgr_gain15 GAIN15 Gain for Channel 15
@{*/
/**@}*/


#define ADC_CGR_GAIN14_SHIFT		28
#define ADC_CGR_GAIN14_MASK		0x03
/** @defgroup adc_cgr_gain14 GAIN14 Gain for Channel 14
@{*/
/**@}*/


#define ADC_CGR_GAIN13_SHIFT		26
#define ADC_CGR_GAIN13_MASK		0x03
/** @defgroup adc_cgr_gain13 GAIN13 Gain for Channel 13
@{*/
/**@}*/


#define ADC_CGR_GAIN12_SHIFT		24
#define ADC_CGR_GAIN12_MASK		0x03
/** @defgroup adc_cgr_gain12 GAIN12 Gain for Channel 12
@{*/
/**@}*/


#define ADC_CGR_GAIN11_SHIFT		22
#define ADC_CGR_GAIN11_MASK		0x03
/** @defgroup adc_cgr_gain11 GAIN11 Gain for Channel 11
@{*/
/**@}*/


#define ADC_CGR_GAIN10_SHIFT		20
#define ADC_CGR_GAIN10_MASK		0x03
/** @defgroup adc_cgr_gain10 GAIN10 Gain for Channel 10
@{*/
/**@}*/


#define ADC_CGR_GAIN9_SHIFT		18
#define ADC_CGR_GAIN9_MASK		0x03
/** @defgroup adc_cgr_gain9 GAIN9 Gain for Channel 9
@{*/
/**@}*/


#define ADC_CGR_GAIN8_SHIFT		16
#define ADC_CGR_GAIN8_MASK		0x03
/** @defgroup adc_cgr_gain8 GAIN8 Gain for Channel 8
@{*/
/**@}*/


#define ADC_CGR_GAIN7_SHIFT		14
#define ADC_CGR_GAIN7_MASK		0x03
/** @defgroup adc_cgr_gain7 GAIN7 Gain for Channel 7
@{*/
/**@}*/


#define ADC_CGR_GAIN6_SHIFT		12
#define ADC_CGR_GAIN6_MASK		0x03
/** @defgroup adc_cgr_gain6 GAIN6 Gain for Channel 6
@{*/
/**@}*/


#define ADC_CGR_GAIN5_SHIFT		10
#define ADC_CGR_GAIN5_MASK		0x03
/** @defgroup adc_cgr_gain5 GAIN5 Gain for Channel 5
@{*/
/**@}*/


#define ADC_CGR_GAIN4_SHIFT		8
#define ADC_CGR_GAIN4_MASK		0x03
/** @defgroup adc_cgr_gain4 GAIN4 Gain for Channel 4
@{*/
/**@}*/


#define ADC_CGR_GAIN3_SHIFT		6
#define ADC_CGR_GAIN3_MASK		0x03
/** @defgroup adc_cgr_gain3 GAIN3 Gain for Channel 3
@{*/
/**@}*/


#define ADC_CGR_GAIN2_SHIFT		4
#define ADC_CGR_GAIN2_MASK		0x03
/** @defgroup adc_cgr_gain2 GAIN2 Gain for Channel 2
@{*/
/**@}*/


#define ADC_CGR_GAIN1_SHIFT		2
#define ADC_CGR_GAIN1_MASK		0x03
/** @defgroup adc_cgr_gain1 GAIN1 Gain for Channel 1
@{*/
/**@}*/


#define ADC_CGR_GAIN0_SHIFT		0
#define ADC_CGR_GAIN0_MASK		0x03
/** @defgroup adc_cgr_gain0 GAIN0 Gain for Channel 0
@{*/
/**@}*/


/**@}*/

/** @defgroup adc_cor COR Channel Offset Register
@{*/

/** ADC_COR_DIFF15 Differential inputs for channel 15 **/
#define ADC_COR_DIFF15		(1 << 31)
/** ADC_COR_DIFF14 Differential inputs for channel 14 **/
#define ADC_COR_DIFF14		(1 << 30)
/** ADC_COR_DIFF13 Differential inputs for channel 13 **/
#define ADC_COR_DIFF13		(1 << 29)
/** ADC_COR_DIFF12 Differential inputs for channel 12 **/
#define ADC_COR_DIFF12		(1 << 28)
/** ADC_COR_DIFF11 Differential inputs for channel 11 **/
#define ADC_COR_DIFF11		(1 << 27)
/** ADC_COR_DIFF10 Differential inputs for channel 10 **/
#define ADC_COR_DIFF10		(1 << 26)
/** ADC_COR_DIFF9 Differential inputs for channel 9 **/
#define ADC_COR_DIFF9		(1 << 25)
/** ADC_COR_DIFF8 Differential inputs for channel 8 **/
#define ADC_COR_DIFF8		(1 << 24)
/** ADC_COR_DIFF7 Differential inputs for channel 7 **/
#define ADC_COR_DIFF7		(1 << 23)
/** ADC_COR_DIFF6 Differential inputs for channel 6 **/
#define ADC_COR_DIFF6		(1 << 22)
/** ADC_COR_DIFF5 Differential inputs for channel 5 **/
#define ADC_COR_DIFF5		(1 << 21)
/** ADC_COR_DIFF4 Differential inputs for channel 4 **/
#define ADC_COR_DIFF4		(1 << 20)
/** ADC_COR_DIFF3 Differential inputs for channel 3 **/
#define ADC_COR_DIFF3		(1 << 19)
/** ADC_COR_DIFF2 Differential inputs for channel 2 **/
#define ADC_COR_DIFF2		(1 << 18)
/** ADC_COR_DIFF1 Differential inputs for channel 1 **/
#define ADC_COR_DIFF1		(1 << 17)
/** ADC_COR_DIFF0 Differential inputs for channel 0 **/
#define ADC_COR_DIFF0		(1 << 16)
/** ADC_COR_OFF15 Offset for channel 15 **/
#define ADC_COR_OFF15		(1 << 15)
/** ADC_COR_OFF14 Offset for channel 14 **/
#define ADC_COR_OFF14		(1 << 14)
/** ADC_COR_OFF13 Offset for channel 13 **/
#define ADC_COR_OFF13		(1 << 13)
/** ADC_COR_OFF12 Offset for channel 12 **/
#define ADC_COR_OFF12		(1 << 12)
/** ADC_COR_OFF11 Offset for channel 11 **/
#define ADC_COR_OFF11		(1 << 11)
/** ADC_COR_OFF10 Offset for channel 10 **/
#define ADC_COR_OFF10		(1 << 10)
/** ADC_COR_OFF9 Offset for channel 9 **/
#define ADC_COR_OFF9		(1 << 9)
/** ADC_COR_OFF8 Offset for channel 8 **/
#define ADC_COR_OFF8		(1 << 8)
/** ADC_COR_OFF7 Offset for channel 7 **/
#define ADC_COR_OFF7		(1 << 7)
/** ADC_COR_OFF6 Offset for channel 6 **/
#define ADC_COR_OFF6		(1 << 6)
/** ADC_COR_OFF5 Offset for channel 5 **/
#define ADC_COR_OFF5		(1 << 5)
/** ADC_COR_OFF4 Offset for channel 4 **/
#define ADC_COR_OFF4		(1 << 4)
/** ADC_COR_OFF3 Offset for channel 3 **/
#define ADC_COR_OFF3		(1 << 3)
/** ADC_COR_OFF2 Offset for channel 2 **/
#define ADC_COR_OFF2		(1 << 2)
/** ADC_COR_OFF1 Offset for channel 1 **/
#define ADC_COR_OFF1		(1 << 1)
/** ADC_COR_OFF0 Offset for channel 0 **/
#define ADC_COR_OFF0		(1 << 0)

/**@}*/

/** @defgroup adc_cdr[0] CDR[0] Channel Data Register
@{*/


#define ADC_CDR[0]_DATA_SHIFT		0
#define ADC_CDR[0]_DATA_MASK		0xfff
/** @defgroup adc_cdr[0]_data DATA Converted Data
@{*/
/**@}*/


/**@}*/

/** @defgroup adc_cdr[1] CDR[1] Channel Data Register
@{*/


#define ADC_CDR[1]_DATA_SHIFT		0
#define ADC_CDR[1]_DATA_MASK		0xfff
/** @defgroup adc_cdr[1]_data DATA Converted Data
@{*/
/**@}*/


/**@}*/

/** @defgroup adc_cdr[2] CDR[2] Channel Data Register
@{*/


#define ADC_CDR[2]_DATA_SHIFT		0
#define ADC_CDR[2]_DATA_MASK		0xfff
/** @defgroup adc_cdr[2]_data DATA Converted Data
@{*/
/**@}*/


/**@}*/

