grevaillot/svd_tools/headers/ATSAM3X8H/adc.h
/** @defgroup adc_cdr[3] CDR[3] Channel Data Register
@{*/


#define ADC_CDR[3]_DATA_SHIFT		0
#define ADC_CDR[3]_DATA_MASK		0xfff
/** @defgroup adc_cdr[3]_data DATA Converted Data
@{*/
/**@}*/


/**@}*/

/** @defgroup adc_cdr[4] CDR[4] Channel Data Register
@{*/


#define ADC_CDR[4]_DATA_SHIFT		0
#define ADC_CDR[4]_DATA_MASK		0xfff
/** @defgroup adc_cdr[4]_data DATA Converted Data
@{*/
/**@}*/


/**@}*/

/** @defgroup adc_cdr[5] CDR[5] Channel Data Register
@{*/


#define ADC_CDR[5]_DATA_SHIFT		0
#define ADC_CDR[5]_DATA_MASK		0xfff
/** @defgroup adc_cdr[5]_data DATA Converted Data
@{*/
/**@}*/


/**@}*/

/** @defgroup adc_cdr[6] CDR[6] Channel Data Register
@{*/


#define ADC_CDR[6]_DATA_SHIFT		0
#define ADC_CDR[6]_DATA_MASK		0xfff
/** @defgroup adc_cdr[6]_data DATA Converted Data
@{*/
/**@}*/


/**@}*/

/** @defgroup adc_cdr[7] CDR[7] Channel Data Register
@{*/


#define ADC_CDR[7]_DATA_SHIFT		0
#define ADC_CDR[7]_DATA_MASK		0xfff
/** @defgroup adc_cdr[7]_data DATA Converted Data
@{*/
/**@}*/


/**@}*/

/** @defgroup adc_cdr[8] CDR[8] Channel Data Register
@{*/


#define ADC_CDR[8]_DATA_SHIFT		0
#define ADC_CDR[8]_DATA_MASK		0xfff
/** @defgroup adc_cdr[8]_data DATA Converted Data
@{*/
/**@}*/


/**@}*/

/** @defgroup adc_cdr[9] CDR[9] Channel Data Register
@{*/


#define ADC_CDR[9]_DATA_SHIFT		0
#define ADC_CDR[9]_DATA_MASK		0xfff
/** @defgroup adc_cdr[9]_data DATA Converted Data
@{*/
/**@}*/


/**@}*/

/** @defgroup adc_cdr[10] CDR[10] Channel Data Register
@{*/


#define ADC_CDR[10]_DATA_SHIFT		0
#define ADC_CDR[10]_DATA_MASK		0xfff
/** @defgroup adc_cdr[10]_data DATA Converted Data
@{*/
/**@}*/


/**@}*/

/** @defgroup adc_cdr[11] CDR[11] Channel Data Register
@{*/


#define ADC_CDR[11]_DATA_SHIFT		0
#define ADC_CDR[11]_DATA_MASK		0xfff
/** @defgroup adc_cdr[11]_data DATA Converted Data
@{*/
/**@}*/


/**@}*/

/** @defgroup adc_cdr[12] CDR[12] Channel Data Register
@{*/


#define ADC_CDR[12]_DATA_SHIFT		0
#define ADC_CDR[12]_DATA_MASK		0xfff
/** @defgroup adc_cdr[12]_data DATA Converted Data
@{*/
/**@}*/


/**@}*/

/** @defgroup adc_cdr[13] CDR[13] Channel Data Register
@{*/


#define ADC_CDR[13]_DATA_SHIFT		0
#define ADC_CDR[13]_DATA_MASK		0xfff
/** @defgroup adc_cdr[13]_data DATA Converted Data
@{*/
/**@}*/


/**@}*/

/** @defgroup adc_cdr[14] CDR[14] Channel Data Register
@{*/


#define ADC_CDR[14]_DATA_SHIFT		0
#define ADC_CDR[14]_DATA_MASK		0xfff
/** @defgroup adc_cdr[14]_data DATA Converted Data
@{*/
/**@}*/


/**@}*/

/** @defgroup adc_cdr[15] CDR[15] Channel Data Register
@{*/


#define ADC_CDR[15]_DATA_SHIFT		0
#define ADC_CDR[15]_DATA_MASK		0xfff
/** @defgroup adc_cdr[15]_data DATA Converted Data
@{*/
/**@}*/


/**@}*/

/** @defgroup adc_acr ACR Analog Control Register
@{*/


#define ADC_ACR_IBCTL_SHIFT		8
#define ADC_ACR_IBCTL_MASK		0x03
/** @defgroup adc_acr_ibctl IBCTL ADC Bias Current Control
@{*/
/**@}*/

/** ADC_ACR_TSON Temperature Sensor On **/
#define ADC_ACR_TSON		(1 << 4)

/**@}*/

/** @defgroup adc_wpmr WPMR Write Protect Mode Register
@{*/


#define ADC_WPMR_WPKEY_SHIFT		8
#define ADC_WPMR_WPKEY_MASK		0xffffff
/** @defgroup adc_wpmr_wpkey WPKEY Write Protect KEY
@{*/
/**@}*/

/** ADC_WPMR_WPEN Write Protect Enable **/
#define ADC_WPMR_WPEN		(1 << 0)

/**@}*/

/** @defgroup adc_wpsr WPSR Write Protect Status Register
@{*/


#define ADC_WPSR_WPVSRC_SHIFT		8
#define ADC_WPSR_WPVSRC_MASK		0xffff
/** @defgroup adc_wpsr_wpvsrc WPVSRC Write Protect Violation Source
@{*/
/**@}*/

/** ADC_WPSR_WPVS Write Protect Violation Status **/
#define ADC_WPSR_WPVS		(1 << 0)

/**@}*/

/** @defgroup adc_rpr RPR Receive Pointer Register
@{*/


#define ADC_RPR_RXPTR_SHIFT		0
#define ADC_RPR_RXPTR_MASK		0xffffffff
/** @defgroup adc_rpr_rxptr RXPTR Receive Pointer Register
@{*/
/**@}*/


/**@}*/

/** @defgroup adc_rcr RCR Receive Counter Register
@{*/


#define ADC_RCR_RXCTR_SHIFT		0
#define ADC_RCR_RXCTR_MASK		0xffff
/** @defgroup adc_rcr_rxctr RXCTR Receive Counter Register
@{*/
/**@}*/


/**@}*/

/** @defgroup adc_rnpr RNPR Receive Next Pointer Register
@{*/


#define ADC_RNPR_RXNPTR_SHIFT		0
#define ADC_RNPR_RXNPTR_MASK		0xffffffff
/** @defgroup adc_rnpr_rxnptr RXNPTR Receive Next Pointer
@{*/
/**@}*/


/**@}*/

/** @defgroup adc_rncr RNCR Receive Next Counter Register
@{*/


#define ADC_RNCR_RXNCTR_SHIFT		0
#define ADC_RNCR_RXNCTR_MASK		0xffff
/** @defgroup adc_rncr_rxnctr RXNCTR Receive Next Counter
@{*/
/**@}*/


/**@}*/

/** @defgroup adc_ptcr PTCR Transfer Control Register
@{*/

/** ADC_PTCR_TXTDIS Transmitter Transfer Disable **/
#define ADC_PTCR_TXTDIS		(1 << 9)
/** ADC_PTCR_TXTEN Transmitter Transfer Enable **/
#define ADC_PTCR_TXTEN		(1 << 8)
/** ADC_PTCR_RXTDIS Receiver Transfer Disable **/
#define ADC_PTCR_RXTDIS		(1 << 1)
/** ADC_PTCR_RXTEN Receiver Transfer Enable **/
#define ADC_PTCR_RXTEN		(1 << 0)

/**@}*/

/** @defgroup adc_ptsr PTSR Transfer Status Register
@{*/

/** ADC_PTSR_TXTEN Transmitter Transfer Enable **/
#define ADC_PTSR_TXTEN		(1 << 8)
/** ADC_PTSR_RXTEN Receiver Transfer Enable **/
#define ADC_PTSR_RXTEN		(1 << 0)

/**@}*/
